{
	"name": "Streadata.io API Gallery - Azure Data Lake Analytics",
	"description": "This is a repository of azure data lake analytics APIs, self-contained as a Github repository, with HTML and YAML representations of the APIs and their surrounding operations.",
	"image": "http://template.streamdata.gallery/assets/azure-data-lake-analytics.png",
	"created": "2018-02-24",
	"modified": "2018-08-29",
	"url": "http://azure-data-lake-analytics.streamdata.gallery/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "Azure Data Lake Analytics",
			"x-api-slug": "azure-data-lake-analytics",
			"description": "The Data Lake analytics service is a new distributed analytics service built on Apache YARN that dynamically scales so you can focus on your business goals, not on distributed infrastructure. Instead of deploying, configuring and tuning hardware, you write queries to transform your data and extract valuable insights. The analytics service can handle jobs of any scale instantly by simply setting the dial for how much power you need. You only pay for your job when it is running making it cost-effective. The analytics service supports Azure Active Directory letting you simply manage access and roles, integrated with your on-premises identity system. It also includes U-SQL, a language that unifies the benefits of SQL with the expressive power of user code. U-SQL&rsquo;s scalable distributed runtime enables you to efficiently analyze data in the store and across SQL Servers in Azure, Azure SQL Database and Azure SQL Data Warehouse.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/data-lake-analytics-05.png",
			"humanURL": "https://azure.microsoft.com/en-us/services/data-lake-analytics/",
			"baseURL": ":////",
			"tags": "Azure Data Lake Analytics",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-organizations/azure-data-lake-analytics/master/_listings/azure-data-lake-analytics/openapi.md"
				}
			]
		}
	],
	"tags": "Azure Data Lake Analytics",
	"include": [
		{
			"name": "Azure Data Lake Analytics",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-organizations/azure-data-lake-analytics/master/_listings/azure-data-lake-analytics/apis.yaml"
		}
	]
}